# WinderFirstLegTooShortOrRunWidthTooGreatFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderFirstLegTooShortOrRunWidthTooGreatFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The first leg of winder run is too short or the runwidth is too great.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderFirstLegTooShortOrRunWidthTooGreatFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderFirstLegTooShortOrRunWidthTooGreatFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderFirstLegTooShortOrRunWidthTooGreatFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace